In [89]:
import plotly.offline as plt
import pandas as pd
import matplotlib as matplot

In [105]:
df_main = pd.read_csv("Dataset\german_credit_data.csv", index_col = 0)

In [106]:
df_main.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 9 columns):
Age                 1000 non-null int64
Sex                 1000 non-null object
Job                 1000 non-null int64
Housing             1000 non-null object
Saving accounts     817 non-null object
Checking account    606 non-null object
Credit amount       1000 non-null int64
Duration            1000 non-null int64
Purpose             1000 non-null object
dtypes: int64(4), object(5)
memory usage: 78.1+ KB

In [107]:
df_main.nunique()

Age                  53
Sex                   2
Job                   4
Housing               3
Saving accounts       4
Checking account      3
Credit amount       921
Duration             33
Purpose               8
dtype: int64

In [108]:
df_main.head()

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
Index,,,,,,,,,
0,67,male,2,own,NaN,little,1169,6,radio/TV
1,22,female,2,own,little,moderate,5951,48,radio/TV
2,49,male,1,own,little,NaN,2096,12,education
3,45,male,2,free,little,little,7882,42,furniture/equipment
4,53,male,2,free,little,little,4870,24,car

In [110]:
plt.plot([{
    'x' : df_main.index ,
    'y' :df_main.Housing
    
}])

'temp-plot.html'

In [111]:
df_sub = df_main[['Age', 'Housing', 'Purpose']]

In [112]:
plt.plot([{
    'x' : df_sub.index ,
    'y' : df_sub[col],
    'name' : col
    
}
for col in df_sub.columns])

'temp-plot.html'